[{"course_code":"APMTH 50","useful_title":"Introduction to Applied Mathematics","course_score_mean":4.09,"rec_score_mean":4.24,"gem_probability_mean":0.0588235294,"sentiment_score_median":0.9022,"best_gem_comment":"This course is a gem that is also interesting and useful. It is a nice introduction to applied mathematics, and the course consists of 6 units each covering different topics (machine learning, information theory, etc.). The class has no exams, only 1 HW and 1 lab per unit (so 11 “PSETS” total). There is also a final project, and you give 2 in–class presentations . If you put some effort into the HWs and lab, you will have no problem getting an A in this class, and the grading is not harsh. Attendance is also only required on presentation days, which occur roughly once a month. Solid class overall, and a nice basic intro.","workload_score_mean":4.91,"best_gem_comment_short":"This course is a gem that is also interesting and useful.","course_id":"122564","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=90e7d358f7aff6be884cd37aa28d251c28952ea93254de42f259f5e090d8b8008bbe8907942725564b4dde66b2ab9cb8&ReportType=2&regl=en-US"},{"course_code":"APMTH 115","useful_title":"Mathematical Modeling","course_score_mean":3.88,"rec_score_mean":3.98,"gem_probability_mean":0.0322580645,"sentiment_score_median":0.8739,"best_gem_comment":"This class is extremely fun! Michael is a very enthusiastic, though disorganized, professor, and he will go through various theories and models that are surprisingly applicable to the real world. Furthermore, the teaching staff behind him were a pleasure also, especially Francesco. As an in–season athlete, the workload of the class was barely manageable alongside my 3 other PSET classes but for sure doable with 1 other PSET classes. I would argue it might be a little bit of a hidden gem given how much support is given in the course to help you succeed in the class. Even when you had projects or PSETs, the work actually required to complete them can be very reasonable for a good grade!","workload_score_mean":6.79,"best_gem_comment_short":"I would argue it might be a little bit of a hidden gem given how much support is given in the course to help you succeed in the class.","course_id":"118021","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb494355949a3b2d5da8e95e29d56c80333cf56a5d606349a36ce71b307ccd4dd48d9fca84e01f99ca85a8e7a17751e9&ReportType=2&regl=en-US"}]