[{"course_code":"ASTRON 5","useful_title":"Astrosociology","course_score_mean":4.68,"rec_score_mean":4.95,"gem_probability_mean":0.0769230769,"sentiment_score_median":0.9465,"best_gem_comment":"TAKE THIS CLASS! it's such a gem and you'll love coming to every class even though it is a 9 am. Professor Sonnert and Shelley are the absolute best duo. You get to play games, roleplay etc. The assignments are not difficult at all. TAKE IF YOU ARE LUCKY ENOUGH TO GET!","workload_score_mean":2.16,"best_gem_comment_short":"it's such a gem and you'll love coming to every class even though it is a 9 am.","course_id":"205519","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cc38a754a61a213935c3e594aa1e2de74b8038763f47fa86acd15916115c487252f67f2eec6fb10b1d44e1cb4194d857&ReportType=2&regl=en-US"},{"course_code":"ASTRON 16","useful_title":"Stellar and Planetary Astronomy","course_score_mean":3.95,"rec_score_mean":4.1,"gem_probability_mean":0.0625,"sentiment_score_median":0.8829,"best_gem_comment":"This is a cool class, and I would recommend taking it! It's unlike anything I've taken here at Harvard, since the majority of class is structured entirely around doing board work with your peers. The exams, which consist of you teaching material to \"outsiders,\" was also a very cool aspect of the experience. The HWs were a bit unstructured, and sometimes you don't get to complete a WS before going off to the next one. Hopefully this will be fixed in future years, since this was the first year some of the HWs were issued. I think it's a gem grading wise, since the TFs are very lenient and you shouldn't really worry about your final grade. Professor Johnson is really fascinating (one of the top figures in exoplanetary research) and he has some interesting lectures.","workload_score_mean":5.8,"best_gem_comment_short":"I think it's a gem grading wise, since the TFs are very lenient and you shouldn't really worry about your final grade.","course_id":"118136","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=efd8617c22ab2195e5da468fc200e346c3f52ff508c63e4332a67f27bcfd2125f8ca5e084f1ebe393d5dcb4dd9b20f3a&ReportType=2&regl=en-US"}]