[{"course_code":"COMPSCI 196","useful_title":"Designing K–12 Computer Science Learning Experiences","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.1111111111,"sentiment_score_median":0.9797,"best_gem_comment":"GUARANTEED ***A*** FOR YOUR GPA. That's entirely true, everybody I've talked to (20+ students) have gotten an A in this course. Now that I have your attention, CS196 is the EASIEST and MOST ENJOYABLE 100 level CS course you can take, and I'm sure about that. This class is an absolute GEM with a light workload and amazing teaching staff. The only real work for the entire course is the final project, but it's actually quite fun since you can decide what to do for the final project (I really mean that, students have done things only tangentially related to CS education and it was always allowed). There's only one meeting a week and it always has a cart full of free snacks + drinks (you can request which snacks you want). You should absolutely apply, no matter who you are. I'm a graduating senior and this was the BEST course I've ever taken in my ENTIRE LIFE, so hopefully that gives you an idea of how mind–blowingly great it is!","workload_score_mean":4.62,"best_gem_comment_short":"This class is an absolute GEM with a light workload and amazing teaching staff.","course_id":"221939","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=15576bc0ff2e96bbbdd7edd346801f56aaa1226a6c72d3bcca6d46268cae3700971a44a89f6ae72d0e201e850982b609&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 191","useful_title":"Classics of Computer Science","course_score_mean":4.38,"rec_score_mean":4.43,"gem_probability_mean":0.0555555556,"sentiment_score_median":0.81,"best_gem_comment":"Harry Lewis is a treasure and this class is the biggest GEM I've taken at Harvard.  Yes, it sucks that your entire grade is basically determined by a very subjectively graded final video project, but honestly who cares––you get to sit around tables and relive the evolution of computer science twice a week!  The guest lecturers are Turing award winning geniuses, and Harry's mini–lectures at the start of class are great; you should close your laptop and pay attention because they do such an amazing job at concisely summarizing the importance of that week's papers.","workload_score_mean":3.45,"best_gem_comment_short":"Harry Lewis is a treasure and this class is the biggest GEM I've taken at Harvard.","course_id":"204964","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=10379282a1ccda25b17f85f72def2a22f351a93820284a2c035e988224e65fd407ebf2fb0973ab5d659f9040a960e849&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 32","useful_title":"Computational Thinking and Problem Solving","course_score_mean":4.32,"rec_score_mean":4.36,"gem_probability_mean":0.0104166667,"sentiment_score_median":0.8438,"best_gem_comment":"Gem but if you actually wanna learn you should either take cs50 or have great self–discipline to make sure you actually do work through the semester","workload_score_mean":5.66,"best_gem_comment_short":"Gem but if you actually wanna learn you should either take cs50 or have great self–discipline to make sure you actually do work through the semester","course_id":"219744","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0e90015b85b4616b4a3714111ad9afd5fb438dced6b02038f46ee54203ea67c0fc154a5f819a9edb999960fea27047d8&ReportType=2&regl=en-US"}]