[{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":4.83,"rec_score_mean":5.0,"gem_probability_mean":0.125,"sentiment_score_median":0.9327,"best_gem_comment":"TAKE THIS CLASS! Andrés is an absolute gem of a person, a very fair grader, gets constructive and thorough feedback back to you in a timely manner, always facilitates discussion and participation rather than simply lecturing at you, and is easily accessible outside of class. He truly cares about his students' growth and success, and it shows through the way he runs his class. If you have any interest in urban economics, take this class. Even if you don't have any interest in urban economics, take this class. The theories and topics discussed are very real–world applicable and interesting. Each class meeting will discuss a different academic paper; engage with each one fully to get the most out of the class, not only for writing your own research paper at the end, but for broader lessons to take with you beyond the class. For 970, your lecturer is arguably more important than the topic of the tutorial itself, and I promise you will not find a better one than Andrés. I have been waiting all semester to write this raving review. Words cannot express how much I recommend you choose Economics of Cities, and more importantly, any tutorial that Andrés is teaching. Again, TAKE THIS CLASS!!!","workload_score_mean":6.75,"best_gem_comment_short":"Andrés is an absolute gem of a person, a very fair grader, gets constructive and thorough feedback back to you in a timely manner, always facilitates discussion and participation rather than simply lecturing at you, and is easily accessible outside of class.","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5f1dcb89e82bd39265ecabf2ba8cb23d4b26ca452943d259ea3fa86d04e45b203aa907c61eb92bbd8c7365dae1f61f42&ReportType=2&regl=en-US"},{"course_code":"ECON 50","useful_title":"Using Big Data to Solve Economic and Social Problems with Laboratory Component","course_score_mean":4.28,"rec_score_mean":4.24,"gem_probability_mean":0.0344827586,"sentiment_score_median":0.80915,"best_gem_comment":"I would totally recommend this course. I took it as my econ writing elective, but I'm telling my friends who aren't ec concentrators that they should take it now too! I admit I thought the title \"Big Data\" sounded pretty boring, and even in the first couple lectures I thought it might be dull, but I encourage you to stick it out! The content is SO interesting and pretty much all of it connects back to Harvard and the students here. I will admit that it wasn't a total gem because you need to study for the midterm and final and write an empirical paper, but there are so many support resources in this course that studying for the exams was super doable, and writing the paper wasn't bad because you get to choose a topic that is of personal interest to you.  I took the course concurrently with two other hard classes and it was doable, but again, don't count on it being a complete gem. I fell into the trap of not going to lecture for the first half of the semester, so I ended up watching like 12 lectures over spring break, so just try to be more diligent than I was! There's a weekly lab if you get a chill TF they'll give you time to complete the lab assignments during lab. Overall, this was a great combo of having a relatively light course and also feeling like I learned really important stuff.","workload_score_mean":4.49,"best_gem_comment_short":"I will admit that it wasn't a total gem because you need to study for the midterm and final and write an empirical paper, but there are so many support resources in this course that studying for the exams was super doable, and writing the paper wasn't bad because you get to choose a topic that is of personal interest to you.","course_id":"216409","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2e7f36b68dc3e970cebc21276aa4f1341e5dd5846bcf5d946570b4267e8df2066b6c78ad0be4e07283bf6d2b46f67e03&ReportType=2&regl=en-US"},{"course_code":"ECON 10B","useful_title":"Principles of Economics (Macroeconomics)","course_score_mean":4.12,"rec_score_mean":4.25,"gem_probability_mean":0.006097561,"sentiment_score_median":0.70145,"best_gem_comment":"IT'S SUCH A BIG CLASS. It's a right of passage for Freshman but just be aware. Kind of a GEM until, WHICH IS WORTH 40% OF YOUR GRADE. Do study though because everyone else will.","workload_score_mean":4.39,"best_gem_comment_short":"Kind of a GEM until, WHICH IS WORTH 40% OF YOUR GRADE.","course_id":"109894","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1fafa1f61929f223751bbaee4da72677b3816cef13f03c4082aba38eeea3f32bc94d6c227b3cbe27619ec831d531b4f4&ReportType=2&regl=en-US"}]