[{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 216","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.1818181818,"sentiment_score_median":0.9862,"best_gem_comment":"This Expos class is a gem and make this your top choice!! Dr. Gold is extremely specific and provides a variety of ways to comments and feedback (a draft conference, video, and comments). Her unit curriculum is extremely organized, and you know exactly what you are going to do for the rest of the semester if you're the type of person to plan ahead. The readings are incredibly interesting even if you aren't interested in discussing feminism or any social issues (which was the case for me, and I feel a lot more comfortable discussing these issues). Dr. Gold doesn't cold call on you if you aren't comfortable, and she really tries to understand your learning and writing style and makes the class a comfortable space for discussion. She has a clear rubric that she grades off from and has a lot more assignments and participation to help your grade, so the two major essays don't completely determine your grade. The capstone project is a lot better to do and allows you to flex your creativity and apply the topics you've learned to the real world rather than writing a third essay. She is very quick to respond to any messages on Slack as well and is extremely funny and engaging. Be sure to utilize the Writing Center or any outside opinion or help edit your essays since class mainly talks about the readings and discussing how to write essays better. She gives you lots of time to work on your essays, just don't procrastinate. Overall, an incredibly fun and interesting class, and I don't regret making this my top choice.","workload_score_mean":4.69,"best_gem_comment_short":"This Expos class is a gem and make this your top choice!!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=48aa48b39314a0dfed3fad0aa321ff7879c1113a8c36a5518e61f74afec7ba76fd6c69a574d6e815c774c30cb8ebd240&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 223","course_score_mean":3.85,"rec_score_mean":4.0,"gem_probability_mean":0.1428571429,"sentiment_score_median":0.8981,"best_gem_comment":"Even if the course material isn't 100% your favorite interest (it wasn't for me, at least), I'd still recommend this class. Isabel is a great teacher who's incredibly accommodating and accessible, which makes the course pretty enjoyable and very far from the time–suck that other Expos courses can be. You definitely get out what you put into the course, but honestly it's a pretty nice gem of an Expos course. Pretty easy readings, straightforward essays, a really nice capstone project (I took this course first semester of freshman year, and when you have a ton of finals you're stressed about, having a podcast which takes like 2–3 hours max to do is a nice break from studying), and overall a good environment. Overall a solid pick.","workload_score_mean":3.83,"best_gem_comment_short":"You definitely get out what you put into the course, but honestly it's a pretty nice gem of an Expos course.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a66e96479f9e0ffd0f41aa921acc50e2f74dea03338b2123dc2f4ad99bc5b66a8fb9c09d7d50c080aa154e2c414c6eda&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 237","course_score_mean":4.42,"rec_score_mean":4.75,"gem_probability_mean":0.0909090909,"sentiment_score_median":0.9673,"best_gem_comment":"This was a solid expos course I'd consider a gem. I am very stem–oriented, and this had a good mixture of humanities and sciences as a social science subject. I am also not too strong in my writing skills, however, Saha was very fair and considerate in her grading. She gave her expectations, and if you did your best to meet them (displayed effort to follow her advice to improve) then you would get a good grade. Sometimes it was a bit boring and instructions were unclear about certain parts of essay expectations. Not bad though I would much rather take this over Orwell. There were some readings, however, many people did not do them and you could usually get by just fine. I never really spent any time on this class unless it was like the day before a paper was due. Saha is also just a wonderful person who shows genuine interest and love for her topic!! BEST EXPOS SECTION IMO","workload_score_mean":3.92,"best_gem_comment_short":"This was a solid expos course I'd consider a gem.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4abbe0f871a6f9bc59750c0793d9938cf20b097f515acd779972f6bc1683aff842035fae3630da9c2299ef934ca318bf&ReportType=2&regl=en-US"}]