[{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 236","course_score_mean":4.46,"rec_score_mean":4.54,"gem_score_mean":0.1428571429,"sentiment_score_median":0.9116,"best_gem_comment":"This class is a gem if you are interested in the topic. Not the best choice for those who want to improve their writing skills – Prof. Routon doesn't give very much feedback on writing and assignments in general. She is an amazing teacher, but I wish that in–class discussions and coursework integrated more college–level theory and information. Overall very good course, but there are a lot of ways it could be better.","workload_score_mean":3.64,"best_gem_comment_short":"This class is a gem if you are interested in the topic.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9b90f83cfb894f9b1872ac3ced01efdfaad57466f4819801b5c0492df47bab5a6fa96967c9c3547d8346f5528d46b16f&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 225","course_score_mean":4.18,"rec_score_mean":3.9,"gem_score_mean":0.125,"sentiment_score_median":0.50165,"best_gem_comment":"This class was, in my opinion, a great example of what an expos class should be. We had many lessons, any many peer assignments, that worked to teach us the fundamental parts of writing. We had timely schedules to do work which forced the class to stay on our game. Dr. M grades harshly but fairly, and this forced all of us to put in lots of work into the class. We got interesting and valuable comments from Dr. M and our peers, and I personally improved my writing over the class by a reasonable amount. Yes, there is dark subject matter, and this isn't a gem, but it is informative and valuable.","workload_score_mean":6.9,"best_gem_comment_short":"Yes, there is dark subject matter, and this isn't a gem, but it is informative and valuable.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=db54a3c27e4b3ab02c7824ba5a8bfd5eb59351a0cdbf8297ec98bd5766375addcc711debc1b0327f89faa624f28ef8a4&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 202","course_score_mean":4.23,"rec_score_mean":4.67,"gem_score_mean":0.1111111111,"sentiment_score_median":0.8008,"best_gem_comment":"Take this class! A gem of an expos class with a brilliant instructor. The course material is universally engaging and applicable.","workload_score_mean":3.55,"best_gem_comment_short":"A gem of an expos class with a brilliant instructor.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=65fd73880535d24baffacb137b90011fa5bfa466dc3f5535ca9296a464abb2410874ab7cfb17b1df4a26f4455f12ad5c&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 242","course_score_mean":4.53,"rec_score_mean":4.36,"gem_score_mean":0.1,"sentiment_score_median":0.9597,"best_gem_comment":"Ian is a gem! He is incredible and his passion for teaching is palpable in every encounter you have with him.","workload_score_mean":4.6,"best_gem_comment_short":"Ian is a gem!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2ed11a51972c0862bf015b85014b5ba99bbe302a420395d00ecfeefc78e443d3defa1fdfd8ab625895a6ba01728745d8&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 210","course_score_mean":4.79,"rec_score_mean":4.92,"gem_score_mean":0.0769230769,"sentiment_score_median":0.9222,"best_gem_comment":"TAKE THIS COURSE!!! I know literally everyone in this Q Guide is probably saying the same thing but LISTEN!! This is literally the best expos ever. I have never understood why anyone else complains about their expos (and people complain a lot) because this is literally my favorite class (AND THIS IS COMING FROM A MATH MAJOR WHO HATED HIGH SCHOOL WRITING).  Every expos class will teach you how to write but most classes have you read a text or two in order to have something to write about and then you are just stressed about the writing (from what I hear :) ). In this course, you get to read SUCH INTERESTING texts (really cool short stories that make you feel seen in a way I never have before and feminist theory that isn't actually that hard to read because Dr. Gold will take you through the important parts and you can literally apply to everything ever). It feels like you are reading things BECAUSE THEY ARE ACTUALLY IMPORTANT and then just writing as another way to think about these ideas more deeply. It takes all the stress out of the class and just makes it fun and worth–while. And you are SURROUNDED BY PEOPLE WHO ARE ACTUALLY PASSIONATE. Everyone in the class most likely put it first choice (that's why there are two sections) and really really care about the issues at hand. You aren't just in a room with people who are taking the class because it is required. This doesn't feel like a required class. Despite my rant about the content of the course, I also think Dr Gold is incredibly good at teaching you to write. She breaks everything down into steps and gives lots of examples and even has a \"Gold Guide\" that she wrote that tells you everything you need to know about writing. I don't think she is the easiest grader in all of expos (if you want an easy A gem this may not be the course for you) but when you actually care about what you are writing it literally doesn't matter. And she will give you so so much feedback (20 minute videos going in depth about her thoughts on your essays) and always be willing to meet and talk about it, that you will truly learn a lot. She will also listen to you all the time and is so easy to come talk to. I sometimes mention to other people (upperclassmen!) that I am in the class and they will light up and start talking about how awesome Dr. Gold is. In conclusion, I took this class because my friend took it last semester and told me to take and I will be forever grateful to him :)))","workload_score_mean":4.46,"best_gem_comment_short":"I don't think she is the easiest grader in all of expos (if you want an easy A gem this may not be the course for you) but when you actually care about what you are writing it literally doesn't matter.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1f2cc160c7038ebff2d1dcea55dc7860821b096c8300cdc388849a2cb806cbbcdc9772e2044071f722796df352d2d94c&ReportType=2&regl=en-US"}]