[{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 206","course_score_mean":4.38,"rec_score_mean":4.33,"gem_probability_mean":0.125,"sentiment_score_median":0.9238,"best_gem_comment":"its expos! so its a little dull. but professor brown is really really nice, and its a gem. not life changing, but good as far as expos goes–––which is saying a lot, considering that prof brown has to make the most of a boring structured requirement course.","workload_score_mean":3.82,"best_gem_comment_short":"but professor brown is really really nice, and its a gem.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=60b8c385b28c138b976b3c4258e6fa1d7822cf9bcbc9e501a43ff5d7f3ccc24279ff9dbcb911a89d54512eb2d750770a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.92,"rec_score_mean":4.92,"gem_probability_mean":0.125,"sentiment_score_median":0.9126,"best_gem_comment":"Time spent per week2.5, 2, 4, 5, 2.5, 1.5, 2.5, 1.5, 5, 1.5, 8, 1.5, 0, 1There will be three speeches you will give. It is up to you how much you prepare for it.In hindsight, I think I should focus less on the material and on crafting the topic, but instead focusing on delivery and speech techniques. Start practicing the speech instead of keep editing your draft or slides: your end goal is to improve your public speaking anyways!I won't say it is a gem, because you meet 2 hours per class, 2 classes per week, so that is already 4 hours per week (outside of prep time). It might take time to craft the speech, and also there was a week with >100 pages of reading. However, grading is very low stress, so just put in as much as you want to get out of it.A strength of the course is that the class bonds quite tightly, so you get to know a certain selection of Harvard people that perhaps you might not necessarily come across. However, most of them will be seniors, so you might not meet them again. Regardless, it is very cool to get to know them deeply and listen to their speeches. Some speeches are really impressive that you will learn and perhaps incorporate some of their style in your speech. There are also speeches that can broaden your world view. Some are hilarious to sit through.There are some fun warm–up exercises reminiscent of summer camp activities like throwing small sandbags while walking in a circle and shouting out the alphabets. You don't get to do this in most other classes.The idea of our speeches being recorded and we get to privately review them afterwards is also pretty powerful.Take it! It is a fun class that really bonds and also a chance for you to develop your public speaking skills! You will get to see and learn quite a lot.","workload_score_mean":4.08,"best_gem_comment_short":"Start practicing the speech instead of keep editing your draft or slides: your end goal is to improve your public speaking anyways!I won't say it is a gem, because you meet 2 hours per class, 2 classes per week, so that is already 4 hours per week (outside of prep time).","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=128b1b65420d5fca9f3e96ea8d7363bd1182723e931724b0341e002e8ac92ae8c39141596b9422f36f0ffe755b824ca2&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 213","course_score_mean":4.58,"rec_score_mean":4.5,"gem_probability_mean":0.1,"sentiment_score_median":0.9204,"best_gem_comment":"I really loved the content of this specific Expos class, and it made me lean toward choosing Art History as a part of my education. Dr. Given does a great job at being available to talk with you about all facets of your writing and he does a really good job at making the semester as stress–free as possible. I would say it is a GEM in the Expos department for sure.","workload_score_mean":5.58,"best_gem_comment_short":"I would say it is a GEM in the Expos department for sure.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6ec58ed613c5cdb33931162444d96e2c0c859f2f265911d747e2f2d1757062d0a9460801b24ec1120f6ffc866747830e&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 224","course_score_mean":4.8,"rec_score_mean":4.53,"gem_probability_mean":0.0714285714,"sentiment_score_median":0.95625,"best_gem_comment":"This is an excellent Expos. It shouldn't be considered a gem, but the readings aren't too bad and the discussion is very enjoyable. Dr. Martin does a great job of structuring the discussion around the readings while still incorporating the real world and connecting to current events. You will get plenty of feedback on your writing, and Dr. Martin tailors the feedback to your personal situation to help you grow throughout the semester.","workload_score_mean":5.2,"best_gem_comment_short":"It shouldn't be considered a gem, but the readings aren't too bad and the discussion is very enjoyable.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3971ffa215691ea0cf90b99e56483051a0eb2d10a96de10f519c9d174126433e7e9ee5223e8711a502215e2ddbed45b9&ReportType=2&regl=en-US"}]