[{"course_code":"GENED 1112","useful_title":"Section ","course_score_mean":3.87,"rec_score_mean":4.1,"gem_score_mean":0.1666666667,"sentiment_score_median":0.80005,"best_gem_comment":"This class is such a gem, especially if you have a nice TF. It's a great class to take with friends since you'll spend an hour at a time discussing things with your table or doing group activities. If you're looking to challenge yourself just know that the only challenge of this class is staying at all engaged during the 2.5 hour classes once a week.","workload_score_mean":3.32,"best_gem_comment_short":"This class is such a gem, especially if you have a nice TF.","course_id":"212919","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=28e55dfd0f7b8f55a1d44e51cbbc0dfeb5801a002bb68893c08177639ae8c1d880ddb273328e618de0b57faacb9ca746&ReportType=2&regl=en-US"},{"course_code":"GENED 1179","useful_title":"Section ","course_score_mean":4.32,"rec_score_mean":4.54,"gem_score_mean":0.1052631579,"sentiment_score_median":0.8689,"best_gem_comment":"Take this course!! This was my favorite class this semester –– the lectures are so interesting (Professor Lunbeck is a great lecturer!) and the papers are short and actually fun to do. Section discussions are engaging and fun and I looked forward to them. The ratio of learning and enjoyment to work in this class is amazing and I would probably call it a gem. The instructors and teaching staff are also so kind and understanding and overall this class is just a pleasure to be in! Definitely take if you are at all interested in psych!","workload_score_mean":2.92,"best_gem_comment_short":"The ratio of learning and enjoyment to work in this class is amazing and I would probably call it a gem.","course_id":"219657","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb55669bf0efd9ae6d6644bcc13be1832283ea4fc789bed66843a263d6d10b4cedcad864db3e40ca62a0b578487ec588&ReportType=2&regl=en-US"},{"course_code":"GENED 1063","useful_title":"Section ","course_score_mean":4.52,"rec_score_mean":4.57,"gem_score_mean":0.0689655172,"sentiment_score_median":0.9167,"best_gem_comment":"TAKE IT!!! SUPER MEGA CHILL GEM AND YOU WILL LEARN SO MUCH JUST BY LISTENING IN LECTURE. You do not have to prepare before class and there are no exams. Just 3 easy and actually engaging assignments. One short policy brief, another 4–5 page policy brief, and final project (which you could also just do another 5 page policy brief). You do not need any prior knowledge and the professor is sooooo good and knowledgeable and she will always fully prepare you for all assignments. The rubrics are super clear so you just have to make sure to touch every point and there is so much support if you ever want to talk through your ideas. I would always look forward to going to lecture and it was one of my favorite classes this semester because it did not require a lot of time but I was constantly learning and gaining knowledge about global health. Highly recommend to anyone who needs to satisfy GenEd requirement of GHHP requirement. Sections did feel unnecessary though.","workload_score_mean":3.71,"best_gem_comment_short":"SUPER MEGA CHILL GEM AND YOU WILL LEARN SO MUCH JUST BY LISTENING IN LECTURE.","course_id":"126193","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=30e0953cddbbbbb1d19f4d4615c17fec8b3afb818b0f48f541aac6a2c71d05b55beb7d208ff337c263279554ae1d83ac&ReportType=2&regl=en-US"},{"course_code":"GENED 1037","useful_title":"Section ","course_score_mean":4.43,"rec_score_mean":4.53,"gem_score_mean":0.0454545455,"sentiment_score_median":0.90365,"best_gem_comment":"This class is an absolute gem, take it if you can!  Max and Phil are great, and I looked forward to going to class each week (even the sections!)","workload_score_mean":3.77,"best_gem_comment_short":"This class is an absolute gem, take it if you can!","course_id":"212854","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7a21545efeba6bc52fa0267f0dd7d9965f3753114bb596055966bc5cb68d1c39ba7126059f740d3a2c9ba35c5a4a1dd3&ReportType=2&regl=en-US"},{"course_code":"GENED 1182","useful_title":"Section ","course_score_mean":3.97,"rec_score_mean":3.88,"gem_score_mean":0.0434782609,"sentiment_score_median":0.8689,"best_gem_comment":"Take this class no matter your background (STEM, humanities, etc.) if you are ready to put the work in and do the readings. Be warned that they can be dense and heavy (about war, incest, pedophilia – check the syllabus). If you are ready to do the readings you'll get a ton out of this gened; Prof. Kim's lectures are super impressive and I enjoyed section as well. How much you get out though is very much up to you. It can be a gem if you want it to be due to the grading system.","workload_score_mean":5.21,"best_gem_comment_short":"It can be a gem if you want it to be due to the grading system.","course_id":"220024","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cb95ed8f20dbfda15ed8ed1c9eb4beee01527d104e45c56c2266eec5c7c243dfcb31dbc25195f661a046d8726bd81153&ReportType=2&regl=en-US"}]