[{"course_code":"GENED 1148","useful_title":"Moctezuma’s Mexico Then and Now Ancient Empires, Race Mixture, and Finding LatinX","course_score_mean":3.85,"rec_score_mean":3.77,"gem_probability_mean":0.0769230769,"sentiment_score_median":0.7863,"best_gem_comment":"Really enjoyed the course material and the teaching team is amazing and super enthusiastic. However, lecture can feel a bit disorganized at times and there are a lot of readings listed, however you do not need to complete them all to participate in section. For the little work put in throughout the semester, the midterm and final are pretty lengthy to make up for it. Overall though, I would still say this class is a gem because it is a fairly light workload but also really interesting material about transculturation, indigeneity, and modern identities.","workload_score_mean":3.32,"best_gem_comment_short":"Overall though, I would still say this class is a gem because it is a fairly light workload but also really interesting material about transculturation, indigeneity, and modern identities.","course_id":"112754","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7d93fdd6d6560a8a76dce96de8a4f44e28daada11623d06cce3c6e0d2fd8a460934056f2c513a6187f19dc101251b119&ReportType=2&regl=en-US"},{"course_code":"GENED 1071","useful_title":"African Spirituality and the Challenges of Modern Times","course_score_mean":4.08,"rec_score_mean":4.28,"gem_probability_mean":0.0555555556,"sentiment_score_median":0.69745,"best_gem_comment":"Take this class if you're looking for a GEM, but also make sure you're actually interested in the subject matter. If you're not, it can be pretty easy to lose motivation for the assignments and slack off.","workload_score_mean":3.01,"best_gem_comment_short":"Take this class if you're looking for a GEM, but also make sure you're actually interested in the subject matter.","course_id":"212849","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3c7840fa827e0355829efe6fada59b74a4c8a1534642ae363d25a27ba1bff02a39c6bc1401972bde1f2fe1381fd4ff9b&ReportType=2&regl=en-US"},{"course_code":"GENED 1053","useful_title":"The Global Heart Disease Epidemic Stopping What We Started","course_score_mean":4.53,"rec_score_mean":4.66,"gem_probability_mean":0.05,"sentiment_score_median":0.8718,"best_gem_comment":"One of the best geneds out there!The class is a gem!This gened has the best effort–vs–learning ratio. The assignments are extremely chill. The professor is nice.– You get to learn and be certified in CPR– You finally internalize all the correct advice on nutrition and exercise. This class literally changed my life as I now have a new diet, a different workout routine, and quitting alcohol (best dosage is zero dosage). These are all things that you probably knew, but this course will make you really understand the advice and take them into advice.– After this class you gain, on average, 10 extra years of healthy life to spend with your loved ones. Bonus years if you spread advice around so your loved ones also get those extra years. Maybe even more.Lastly, I think crimson cart shoppers might have subconsciously avoided this class because of the title \"heart disease\" and people might have the wrong preconception that it is boring since the class is probably full of pre–meds or that the shoppers have the evolutionary instinct to avoid diseases (even its representation as the English word). But that is a mistake. Sure, the class attracts a bunch of pre–meds, but I am not a pre–med and I love this class so much! The content is very accessible and interesting. Everything you learn from this class can be applied in your life. For the second point, good for you if you can overcome the evolutionary instinct to avoid diseases and check this class out and read this qguide comment because you have found one of the great courses of Harvard. Good for you. Now gatekeep this and take it and have fun.","workload_score_mean":2.6,"best_gem_comment_short":"One of the best geneds out there!The class is a gem!This gened has the best effort–vs–learning ratio.","course_id":"215875","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb8a368cf66bf9e203be0eb3c32e92317e5747e12210df7920a997dbb132ff18797d37b6f522690da29cf12d9eb466d7&ReportType=2&regl=en-US"},{"course_code":"GENED 1074","useful_title":"The Ancient Greek Hero","course_score_mean":3.89,"rec_score_mean":4.03,"gem_probability_mean":0.0458715596,"sentiment_score_median":0.7915,"best_gem_comment":"This is of course a GEM, but also a really fun class too. The weekly assignments are creative and enjoyable,  the readings are not necessary,  and even the midterm\/final are presented in a way that makes them not overly boring or honed in on the specifics of Greek texts. I can't believe I'm saying this but this class actually made learning about ancient Greek literature fun – truly a great class.","workload_score_mean":3.45,"best_gem_comment_short":"This is of course a GEM, but also a really fun class too.","course_id":"113501","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ff5a45c620f0a7f1ef89be5fcad038ad808e536fc4fa4322a65dac63c7b51bf72f704bd1302c1c41cd488bfc8f6eae5d&ReportType=2&regl=en-US"},{"course_code":"GENED 1094","useful_title":"Confronting Climate Change A Foundation in Science, Technology and Policy","course_score_mean":3.82,"rec_score_mean":3.94,"gem_probability_mean":0.0379746835,"sentiment_score_median":0.7003,"best_gem_comment":"Take notes. If you take notes, you will barely have to study for midterm, and papers will be super easy to write, as they are mostly based on class material rather than outside research.  GEM class, especially for those interested in the environment. Second half of the course is significantly more interesting than the first.","workload_score_mean":2.42,"best_gem_comment_short":"GEM class, especially for those interested in the environment.","course_id":"126633","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b34ff0a4dd0595a89ac7a9b52d6c26658ac805e0df89e282006f1872eea474cb7a044fee9208fe6f0f1f1c3633408419&ReportType=2&regl=en-US"}]