[{"course_code":"GOV 1759","useful_title":"Behavioral Insights and Public Policy Nudging for Good","course_score_mean":4.38,"rec_score_mean":4.47,"gem_probability_mean":0.0724637681,"sentiment_score_median":0.7982,"best_gem_comment":"Take this course! Not only is it a light workload, but the concepts are incredibly interesting and pretty applicable. Professor Hiscox is such a gem! Engaging, funny, relatable, friendly. The only qualm I have is that there are major discrepancies in TF grading for the presentation, which is a major part of your grade, so make sure you get a good TF.","workload_score_mean":2.55,"best_gem_comment_short":"Professor Hiscox is such a gem!","course_id":"204958","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=adaf77027851b0ae7d8b295f7a1380d53c1844a12b5d557e808de261b92b6dfcab6a5fda192e814c3f1d991e66e7846c&ReportType=2&regl=en-US"},{"course_code":"GOV 1737","useful_title":"Evaluating the Impacts of Public Policies How to Design and Implement Randomized Controlled Trials","course_score_mean":4.55,"rec_score_mean":4.62,"gem_probability_mean":0.0476190476,"sentiment_score_median":0.5994,"best_gem_comment":"GEM! gemmier than gov1759. take it before they make it harder bc everyone knows it is a gem lol. no sections was amazing. also the course load is so small I barely had to do work. Professor Hiscox is actually amazing and loves the topics. He is a great lecturer. 10\/10 class you must take if you want an easy class.","workload_score_mean":3.0,"best_gem_comment_short":"GEM!","course_id":"218749","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=33a735e19c338d2ed957a70b16fa51b5de2734b193026041e81fe1a1703dc789e23b8be99cf9731b632ea7e8b727fc30&ReportType=2&regl=en-US"},{"course_code":"GOV 1318","useful_title":"The Great Food Transformation","course_score_mean":3.88,"rec_score_mean":3.98,"gem_probability_mean":0.0322580645,"sentiment_score_median":0.8478,"best_gem_comment":"This is my second class I have taken with Professor Saha and she truly is a gem. She holds so much expertise in her field, especially as she is the only (empirical) political scientist who studies meat politics. This makes it such a unique experience to learn with her and Harvard is so lucky to have her as an educator here! She is still the sweetest professor I have had to date and is so understanding and kind. The class is not high maintenance at all as it is only one 2–hour course a week, so if you can handle sitting still for 2 hours then this might be a good class for you. The course covers so many issues that the meat industry has caused in society and it is so eye–opening, even if you are not a vegan\/vegetarian (I'm not either but I still love the topic of sustainable eating and animal welfare!) This class could help add to your perspective about veganism or even change it, but regardless of your stance on it, the environment is safe to share your own opinion on the matter!","workload_score_mean":3.42,"best_gem_comment_short":"This is my second class I have taken with Professor Saha and she truly is a gem.","course_id":"221725","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fac48238d9b7feef7368024758fb9939669ced4b76cbc9c6e3e04b56238010ee5daf85d7e76e454bda71bfbab228e6aa&ReportType=2&regl=en-US"}]