[{"course_code":"NEURO 101QB","useful_title":"Section ","course_score_mean":5.0,"rec_score_mean":4.9,"gem_score_mean":0.1428571429,"sentiment_score_median":0.9299,"best_gem_comment":"GEM! Reasonable workload for a full–year course; Vincent is super understanding and kind as a professor and makes the effort to make sure you understand the content (TLDR: meet with him for help). Really interesting course about learning and memory that you can apply to real life. One of the best courses at Harvard I ever took, would recommend this class to everyone!","workload_score_mean":3.38,"best_gem_comment_short":"GEM!","course_id":"218611","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d8f1f798370ba2ef70ae087a579a5ec564dd43b404fe2a4a0da4310642cd914e0dc3284d529f9d500f1bdfdcac96106a&ReportType=2&regl=en-US"},{"course_code":"NEURO 105","useful_title":"Section ","course_score_mean":4.19,"rec_score_mean":4.06,"gem_score_mean":0.1111111111,"sentiment_score_median":0.7763,"best_gem_comment":"Definitely take this class. It is an absolute gem and you will learn a lot! Engert makes sure that you know you are not supposed to worry about your grades in this class and that he merely wants you to focus entirely on the content. The matlab psets are pretty straight forward and there is also help for them. you DONT NEED a programming background! So please dont let that shoo you away. The final exam was a little unguided because there were no practice exams or anything like that, but they say they grade it leniently so it should be fine. Choose a fun  project for the final project, choose something you have wanted to explore, that will make the work and research you do 10 times more fun. Overall, PLEASE TAKE!","workload_score_mean":4.8,"best_gem_comment_short":"It is an absolute gem and you will learn a lot!","course_id":"207528","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5c8b271eea369cdcdd2e7530324657e6610094fa55c7bd5b59a312097d81925434431b18669b719ca795b187fd0908be&ReportType=2&regl=en-US"}]