[{"course_code":"PHYSICS 151","useful_title":"Mechanics","course_score_mean":4.0,"rec_score_mean":3.7,"gem_probability_mean":0.1666666667,"sentiment_score_median":0.87485,"best_gem_comment":"This was far and away my favorite class of the semester, and one of my favorite classes of my time at Harvard so far. I had already taken 15a my freshman fall, but I absolutely do not regret going back for a second pass at mechanics. It is a completely different subject when looked at more deeply, and far more beautiful than I gave it credit for before taking this class. The main content of the class revolves around symmetries and conserved quantities in Lagrangian and Hamiltonian mechanics, a subject that (as professor Jaffe stressed over and over) had very deep connections to modern–day quantum theory.Due to the small class size, we all became pretty close by the end of the class. This was in large part fostered by the gem of a TF, Serhii––try and take any class he TF's in the future, not just 151! Professor Jaffe gave incredible lectures for the most part, and would frequently drop incredibly stories about his life and career. He is an incredibly physicist and a really sweet person––the class party at his house at the end of the semester was definitely a highlight!The only downsides I found in the class were the problem sets and tests. Many of the problem sets (biweekly) were short, so the workload was very manageable for the majority of the semester. However, I found the pset questions to be very detached from the material we were learning in class, with much time spent on endless bashing without any noticeable benefit. The exams were stressful, with professor Jaffe not giving any practice exams or practice problems and forbidding cheat sheets (his teaching style is very old school in general). However, the two in–class midterms comprised only 20% of our grade this semester, so it wasn't the worst thing in the world.We had a final project as our final assessment for the class, which was really fun, albeit quite stressful. It is incredibly how deep of a subject classical mechanics is, and I don't think you get to experience its beauty in any other class at Harvard.Overall, I think that Physics 151 is as close to a gem of a class as you're going to get in the Physics department––relatively low stress and low workload, very interesting and relevant content, and an unforgettable experience with incredible people! I would highly recommend incoming freshman take this class over 15a, 16, or 19 to fulfill their mechanics requirement, especially if you have a decent linear algebra background. (Without a solid linear algebra foundation, it's very hard to appreciate a lot of the material we covered.)","workload_score_mean":6.6,"best_gem_comment_short":"This was in large part fostered by the gem of a TF, Serhii––try and take any class he TF's in the future, not just 151!","course_id":"111231","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=69f3cddc2e434352780418e9382277176ce3d9bc98eccd0108a778d3b31bc9c958d3ae1d76739dd0f381c9dc3723f500&ReportType=2&regl=en-US"}]