[{"course_code":"PSY 1813","useful_title":"Technology and Mental Health","course_score_mean":4.74,"rec_score_mean":4.68,"gem_probability_mean":0.0769230769,"sentiment_score_median":0.9483,"best_gem_comment":"Shifali is a true gem. With that said, if you've taken other psychology electives, it can at times feel a bit repetitive. Also, a majority of the class is discussion – we had plenty of engaging discussions, but sometimes the same voices would speak for a majority of the class. I think the class really depends on the students who take it, and the bulk of your learning will be from your peers. Take for Shifali and for the student led discussions, don't take if you are expecting a truly revolutionary class on technology's affect on mental health.","workload_score_mean":3.05,"best_gem_comment_short":"Shifali is a true gem.","course_id":"220092","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=74ee1862829ab7a2005429930cc411bff998c585c27840d6f41794617688084dc6dd0ffbc61a262173616ffd28ae9992&ReportType=2&regl=en-US"},{"course_code":"PSY 1900","useful_title":"Introduction to Statistics for the Behavioral Sciences","course_score_mean":3.99,"rec_score_mean":4.12,"gem_probability_mean":0.0307692308,"sentiment_score_median":0.704,"best_gem_comment":"This definitely isn’t as much of a gem as it used to be, but it’s still a pretty solid class. You’ll just have to actually go to lecture, so don’t expect it to as laidback as it has been in previous years. If you’re going into the behavioral sciences in any way, everything you learn here will be super useful for interpreting data and understanding existing research papers.","workload_score_mean":4.24,"best_gem_comment_short":"This definitely isn’t as much of a gem as it used to be, but it’s still a pretty solid class.","course_id":"118254","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ce69016d8311addceeb3996081a8f816ef96d45bcff9ad2b45fe8cd211fb91edcfa2f674ce69837f809e704c00d3679b&ReportType=2&regl=en-US"},{"course_code":"PSY 15","useful_title":"Social Psychology","course_score_mean":4.24,"rec_score_mean":4.23,"gem_probability_mean":0.027027027,"sentiment_score_median":0.8168,"best_gem_comment":"I wouldn't call this course a gem, as the workload is relatively intense. You have to read a full textbook *and* another book, write two essays, conduct an experiment in the span of a few weeks, complete weekly discussion posts, and take a midterm and a final. Additionally, the lectures are kind of extemporaneous, so it can be hard to know what to take notes on. However, the content is definitely super interesting and the grading is very fair.","workload_score_mean":4.03,"best_gem_comment_short":"I wouldn't call this course a gem, as the workload is relatively intense.","course_id":"114178","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e75452348fff75805649627a6203a4ed8afa2bbe684e443d1a08aca63774b7ed55383d92e17dfba05299f8e1a453f3d5&ReportType=2&regl=en-US"}]