[{"course_code":"TDM 120","useful_title":"What's so Funny? Introduction to Improvisational Comedy","course_score_mean":4.83,"rec_score_mean":4.83,"gem_probability_mean":0.0909090909,"sentiment_score_median":0.9117,"best_gem_comment":"This is a great class if you're looking for an easy 4th GEM. There is literally no homework at all, except a short response at the end of the week where you briefly talk about your time in class that week. However, if you actually want to learn improv, this maybe isn't the best class. Class was pretty inconsistent with how you'd receive feedback during scene work, which was unfair. For example, asking questions during an improv scene is frowned upon. When guys in our class asked questions during scene work, even if it was necessary for the flow of the scene, they were castigated for doing so immediately, and experienced frequent interruptions in their scene work from Remo. However, when certain girls in our class would make the exact same mistakes, they were not critiqued or interrupted as frequently in their scene work. Why was this the case? Not sure. As a girl, I noticed these differences.It doesn't feel like you really learn anything about improv in this class. You simply play games and exercises for 2 hours, and in the lucky chance that you get to do a scene, you get interrupted constantly by Remo, which makes it extremely difficult to actually learn how to improve. Certain people have certain strengths when it comes to acting, and it didn't feel like we catered to those strengths as much as we could have. There's the famous Einstein quote about how judging a fish by its ability to climb a tree is an inaccurate way to gauge the fish's abilities, and this metaphor could not be applied more to this class. For example, judging one's comfort and ability to dance to Taylor Swift songs in front of everyone is not an accurate way to see how comfortable someone is dancing and how good they are at dancing. Why not switch up the music playlist, and see the differences of how people dance? In this regard The class heavily catered to women like myself, and felt inconsistent with how normal classes at Harvard operate.","workload_score_mean":1.55,"best_gem_comment_short":"This is a great class if you're looking for an easy 4th GEM.","course_id":"160654","link":"https:\/\/harvard.bluera.com\/harvard\/rpvf-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d9dd738f6680cb10c51936db34a2a0b7ceb95fbbddd8132322bb5003293ef2ab2bf685313c8532302d9ddbb1ef46408e&ReportType=2&regl=en-US"}]